import re

# 过滤联系方式，手机号,QQ号,微信号,邮箱号,网址
def filter(html):
    # QQ号
    html = re.sub(r'[1-9]\d{5,11}','50377564',html)
    # 手机号
    html = re.sub(r'^1[35678]\d{9}$','13420877713',html)
    # 微信号
    html = re.sub(r'微信：[\w,-]{5,10}|vx:[\w,-]{5,10}|VX:[\w,-]{5,10}','微信：sky7make',html)
    # 邮箱号
    html = re.sub(r'[a-z0-9\.\-+_]+@[a-z0-9\.\-+_]+\.[a-z]+','50377564@qq.com',html)
    # 网址
    html = re.sub(r'(http[s]?://(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*,]|(?:%[0-9a-fA-F][0-9a-fA-F]))+)|([a-zA-Z]+.\w+\.+[a-zA-Z0-9\/_]+)','',html)

    return html

code = '''
<section class="post-content">
                        <p>
<p><p>有很多的同学是非常的想知道，男女一问一答的套路情话有哪些的，小编整理了相关信息，希望会对大家有所帮助！
</p><p align="center"><img class="alignnone size-full wp-image-2323" src="http://www.duanzi.io/wp-content/uploads/2020/06/6365715905771690791089800.jpg" width="600" height="375" srcset="http://www.duanzi.io/wp-content/uploads/2020/06/6365715905771690791089800.jpg 600w, http://www.duanzi.io/wp-content/uploads/2020/06/6365715905771690791089800-300x188.jpg 300w" sizes="(max-width: 600px) 100vw, 600px" /></p>
<p>让人无法拒绝的套路表白情话</p><p>1、“你喜欢猫还是狗?”</p><p>“猫”</p><p>-“喵～”</p>
<p>2.“爱或者不爱，给我一个字的答复”</p><p>“不爱”</p><p>“一个字的答复好吗!重来”</p>
<p>3.“我们来交换礼物好不好”</p><p>“好啊”</p><p>“嗯好现在开始我是你的你是我的”</p>
<p>4.“同学打扰一下请问这道题怎么做”</p><p>“不好意思我不会”</p><p>“哦你不会啊那我给你讲讲吧”</p>
<p>5.“我背你吧”</p><p>“为什么呀”</p><p>“昨晚一整夜你都在我梦里钻来跑去肯定累坏了”</p>
<p>6.“我可以向你问路吗?”</p><p>“到那里?”</p><p>“到你心里!”</p><p>7.“你能模仿下啄木鸟吗”</p>
<p>“怎么模仿”</p><p>“就拿我的脸当树”</p><p>8.“你怎么跑来了?”</p><p>“我想看到你”</p>
<p>“我会打电话给你啊”</p><p>“打电话看不到你”</p><p>套路情话撩男朋友的</p><p>1.</p>
<p>&#8220;一天天的脑子里想些什么呢&#8221;</p><p>&#8220;想你&#8221;</p>
<p>2.</p><p>&#8220;你不做饭给我吃&#8221;</p><p>&#8220;我哪来力气和你撒娇&#8221;</p>
<p>3.</p><p>说起我男朋友的优点</p><p>总结起来就是五个字</p><p>&#8220;会挑女朋友&#8221;</p>
<p>4.</p><p>&#8220;如果你不怕麻烦的话&#8221;</p><p>&#8220;那就麻烦你跟我在一起吧&#8221;</p><p>5.</p>
<p>&#8220;我昨晚失眠了&#8221;</p><p>&#8220;意思就是想你想了一夜&#8221;</p><p>6.</p>
<p>&#8220;今年只有一个旅游计划&#8221;</p><p>&#8220;就是，见你&#8221;</p><p>7.</p>
<p>“能在愚人节骗我一次吗”</p><p>“好啊”</p><p>“你喜欢我吗?”</p><p>经典撩妹套路</p>
<p>1.“能在愚人节骗我一次吗”</p><p>“好啊”</p><p>“你喜欢我吗?”</p><p>2.“你想清楚再跟我说话”</p>
<p>“我没有在想清楚我在想你”</p><p>3.&#8221;问你个问题，老爸老妈老姐老哥老公哪个和你没有血缘关系?&#8221;</p>
<p>&#8220;老公啊&#8221;</p><p>&#8220;诶~老婆真聪明~&#8221;</p><p>4.你忙归忙</p>
<p>什么时候有空嫁给我?</p><p>5.我想www.666.com你一定很忙</p><p>所以你只看前三个字就好</p><p>6.如果哪一天我想环游世界了，</p>
<p>我可以围着你转一www.77777.cn圈吗?</p><p>7.“今天早上照了照镜子，http://www.sfasb.com然后就想到了找你”</p><p>“为什么”</p>
<p>“这么多日子来，你知道的，每次看到好的东西我都想给你”</p><p>8.我只是喜欢你，</p><p>我没有恶意。</p></p>
</p>
                    </section>
robots.txt是SEO同行们在制定一个网站优化方案时需要首要考虑的一个问题，
任何网站进行SEO优化前，你需要首先写一个非常规范的robots.txt。robots怎么写，这几乎是你制定SEO优化方案、
提升你网站SEO表现最具性价比的工作，(www.baidu.net)没有之一。robots.txt是什么？robots.txt
（统一小写）是一种存放于网站根目录下的ASCII编码的文本文件（其实UTF-8也没任何问题），
它通常告诉网络搜索引擎的漫游器（又称网络蜘蛛），(www.baidu.cn)此网站中的哪些内容是不应被搜索引擎的漫游器获取的，
哪些是可以被漫游器获取的。因为一些系统中的URL是大小写敏感的，所以robots.txt的文件名应统一为小写。robots.txt应放置于网站的根目录下。
如果想单独定义搜索引擎的漫游器访问子目录时的行为，那么可以将自定的设置合并到根目录下的robots.txt，
或者使用robots元数据（Metadata，又称元数据）。有兴趣的联系微信：skymaker
联系QQ:564564,电话：13420866613,联系邮箱：548754@qq.com,文本链接：http://www.abc.net/article.html
'''
# result = filter(code)
# print(result)